elide-interfacees/nrf52-ble-image-transfer-demo/main.c
}


uint16_t update_crc16(uint16_t crc, const uint8_t *data, size_t length) {
    uint16_t poly = 0x1021;  // CRC-16-CCITT polynomial
    for (size_t i = 0; i < length; i++) {
        crc ^= (uint16_t)(data[i] << 8);
        for (uint8_t bit = 0; bit < 8; bit++) {
            if (crc & 0x8000) {
                crc = (crc << 1) ^ poly;
            } else {
                crc <<= 1;
            }
        }
    }
    return crc;
}

unsigned char* _static_img = NULL;
uint32_t _static_img_len = 0;
uint32_t _static_img_pos = 0;
void sandbar_capture_image() {
    if(_static_img == _city_img) {
        _static_img = _sandbar_img;
        _static_img_len = _sandbar_img_len;
    } else {
        _static_img = _city_img;
        _static_img_len = _city_img_len;
    }
    _static_img_pos = 0;
}

uint32_t sandbar_img_bytes_available() {
    return _static_img_len - _static_img_pos;
}

uint32_t sandbar_fill_buffer(uint8_t *buffer, uint32_t bufferSize) {
    uint32_t bytesToRead = _static_img_len - _static_img_pos;
    if (bytesToRead > bufferSize) {
        bytesToRead = bufferSize;
    }
    memcpy(buffer, _static_img + _static_img_pos, bytesToRead);
    _static_img_pos += bytesToRead;
    return bytesToRead;
}

/**@brief Application main function.
 */
int main(void)
{
    uint32_t img_data_length = 0;
    uint8_t img_data_buffer[255];
    
    // Initialize.
    uart_init();
    log_init();
    timers_init();
    buttons_leds_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);
    
    // Start execution.
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
      
    camera_init();

    advertising_start();

    int first = 0;
    int remaining_image_size = 0;
    uint16_t crc = 0xFFFF;  // Initial CRC value

    // Enter main loop.
    for (;;)
    {
        uint32_t image_size;
        ble_gap_phys_t gap_phys_settings;    
        
        if(m_new_command_received != APP_CMD_NOCOMMAND)
        {
            uint32_t new_command = m_new_command_received;
            m_new_command_received = APP_CMD_NOCOMMAND;
            switch(new_command)
            {
                case APP_CMD_SINGLE_CAPTURE:
                    if(arducam_mini_2mp_bytesAvailable() == 0)
                    {
                        NRF_LOG_INFO("Starting capture...");
                        //arducam_mini_2mp_startSingleCapture();
                        //image_size = arducam_mini_2mp_bytesAvailable();
                        sandbar_capture_image();
                        image_size = sandbar_img_bytes_available();
                        NRF_LOG_INFO("Capture complete: size %i bytes", (int)(image_size));
                        ble_its_img_info_t image_info;
                        image_info.file_size_bytes = image_size;
                        ble_its_img_info_send(&m_its, &image_info);
                        first = 1;
                        remaining_image_size = image_size;
                    }
                    break;
            
                case APP_CMD_START_STREAM:
                    NRF_LOG_INFO("Stream mode enabled");                
                    break;
                
                case APP_CMD_STOP_STREAM:
                    NRF_LOG_INFO("Stream mode disabled");
                    break;
                
                case APP_CMD_CHANGE_RESOLUTION:
                    NRF_LOG_INFO("Change resolution to mode: %i", (int)m_new_resolution);
                    switch(m_new_resolution)
                    {
                        case 0:
                            arducam_mini_2mp_setResolution(OV2640_160x120);
                            break;
                    
                        case 1:
                            arducam_mini_2mp_setResolution(OV2640_320x240);
                            break;

                        case 2:
                            arducam_mini_2mp_setResolution(OV2640_640x480);
                            break;

                        case 3:
                            arducam_mini_2mp_setResolution(OV2640_800x600);
                            break;

                        case 4:
                            arducam_mini_2mp_setResolution(OV2640_1024x768);
                            break;
                    
                        case 5:
                            arducam_mini_2mp_setResolution(OV2640_1600x1200);
                            break;
                    
                    } 
                    break;
                
                case APP_CMD_CHANGE_PHY:   
                    NRF_LOG_INFO("Attempting to change phy.");
                    gap_phys_settings.tx_phys = (m_new_phy == 0 ? BLE_GAP_PHY_1MBPS : BLE_GAP_PHY_2MBPS);  
                    gap_phys_settings.rx_phys = (m_new_phy == 0 ? BLE_GAP_PHY_1MBPS : BLE_GAP_PHY_2MBPS);  
        
                    sd_ble_gap_phy_update(m_its.conn_handle, &gap_phys_settings);  
                    break;
            
                case APP_CMD_SEND_BLE_PARAMS:
                    ble_its_ble_params_info_send(&m_its, &m_ble_params_info);
                    break;
            
                default:
                    break;
            }
        }
        
        if(m_stream_mode_active)
        {
            //if(img_data_length == 0 && arducam_mini_2mp_bytesAvailable() == 0)
            if(img_data_length == 0 && sandbar_img_bytes_available() == 0)
            {
                // arducam_mini_2mp_startSingleCapture();
                sandbar_capture_image();

                // image_size = arducam_mini_2mp_bytesAvailable();
                image_size = sandbar_img_bytes_available();
                
                ble_its_img_info_t image_info;
                image_info.file_size_bytes = image_size;
                ble_its_img_info_send(&m_its, &image_info);                
            }
        }
        
        // if(img_data_length > 0 || arducam_mini_2mp_bytesAvailable() > 0)
        if(img_data_length > 0 || sandbar_img_bytes_available() > 0)
        {
            //NRF_LOG_INFO("kirak send image");
            uint32_t ret_code;

            if(first == 1) {
              first = 0;
              NRF_LOG_INFO("kirak total size %i", (int)(remaining_image_size));
              crc = 0xFFFF;  
            }

            do
            {
                if(img_data_length == 0)
                {
                    // img_data_length = arducam_mini_2mp_fillBuffer(img_data_buffer, m_ble_its_max_data_len);
                    img_data_length = sandbar_fill_buffer(img_data_buffer, m_ble_its_max_data_len);
                }
                ret_code = ble_its_send_file_fragment(&m_its, img_data_buffer, img_data_length);
                //NRF_LOG_INFO("kireak ret %i", (int)(ret_code));
                //NRF_LOG_INFO("kireak fragment size %i", (int)(img_data_length));

                if(ret_code == NRF_SUCCESS)
                {
                    remaining_image_size -= img_data_length;
                    NRF_LOG_INFO("kireak remaining size %i", (int)(remaining_image_size));
                    crc = update_crc16(crc, img_data_buffer, img_data_length);

                    img_data_length = 0;
                    
                    // if(remaining_image_size == 0 && arducam_mini_2mp_bytesAvailable() == 0) {
                    if(remaining_image_size == 0 && sandbar_img_bytes_available() == 0) {
                        NRF_LOG_INFO("kireak done");
                        crc = ~crc;
                        NRF_LOG_INFO("Calculated CRC: %u", (unsigned int)crc);
                    }

                }
            }while(ret_code == NRF_SUCCESS);
        }
        
        if(m_new_command_received == APP_CMD_NOCOMMAND)
        {
            idle_state_handle();
        }
    }
}
